tap 'buo/cask-upgrade' # Enables 'brew cu' to upgrade GUI apps

# Core CLI Tools
brew 'bat'        # Modern cat with syntax highlighting
brew 'catimg'     # Image to terminal renderer (for fzf previews)
brew 'fd'         # Modern find alternative (required by fzf)
brew 'figlet'     # ASCII art text generator
brew 'fortune'    # Random fortune cookie messages
brew 'fzf'        # Fuzzy finder
brew 'lolcat'     # Rainbow colored text output
brew 'hexyl'      # Hex viewer (for fzf previews)
brew 'htop'       # Interactive process viewer
brew 'jless'      # JSON viewer and processor
brew 'jq'         # JSON processor
brew 'lf'         # Terminal file manager
brew 'lnav'       # Log file navigator and analyzer
brew 'lsd'        # Modern ls with git integration
brew 'pastel'     # Color manipulation and palette generation
brew 'ripgrep'    # Fast grep alternative
brew 'starship'   # Cross-shell prompt
brew 'taskwarrior-tui' # Terminal UI for taskwarrior
brew 'tz'         # Time zone aware calendar and clock
brew 'watch'      # Execute command periodically
brew 'zoxide'     # Shell extension to navigate faster

# Git Tools
brew 'git'        # Version control
brew 'git-delta'  # Better diff viewer
brew 'git-filter-repo' # Git history rewriting tool
brew 'gitui'      # Terminal UI for git
brew 'gh'         # GitHub CLI
brew 'pre-commit' # Git hooks manager

# Development Tools
brew 'direnv'     # Directory-specific environment variables
brew 'dprint'     # Code formatter
brew 'glow'       # Markdown renderer with syntax highlighting
brew 'go-task'    # Modern task runner (replaces make)
brew 'helix'      # Text editor
brew 'shellcheck' # Shell script static analysis
brew 'taplo'      # TOML formatter

# Language Tools & Version Managers
brew 'mise'       # Unified runtime version manager (replaces nvm, rbenv, pyenv, etc.)
brew 'bison'      # Parser generator (required for PHP compilation)
brew 're2c'       # Lexer generator (required for PHP compilation)
brew 'php'        # PHP language (managed by Homebrew, not mise due to build complexity)
brew 'php@8.1'    # PHP 8.1
brew 'composer'   # PHP package manager

# Cloud & Container Tools (terraform, kubectl, helm, k9s now managed by mise)
brew 'awscli'     # AWS command line
brew 'kubectx'    # Kubernetes context switcher
brew 'terraform-ls' # Terraform language server
brew 'docker'     # Container runtime
brew 'ctop'       # Container monitoring

# Databases
brew 'postgresql@14' # PostgreSQL database
brew 'mysql@8.4'  # MySQL database

# GUI Applications Managers
brew 'mas'        # Mac App Store manager (buggy)

# GUI Applications
# Development
cask 'bruno'                    # API testing tool
cask 'claude-code'              # AI coding assistant
cask 'datagrip'                 # Database IDE
cask 'docker-desktop'           # Container development
cask 'ghostty'                  # Terminal emulator
cask 'local'                    # WordPress development
cask 'sublime-merge'            # Git client
cask 'sublime-text'             # Text editor
cask 'taproom'                  # Homebrew package manager GUI
cask 'visual-studio-code'       # Code editor
cask 'zed'                      # Fast code editor

# Productivity
cask '1password'    # Password manager
cask 'alfred@4'     # Spotlight replacement
cask 'arc'          # Chrome-based browser
cask 'cleanshot'    # Screen capturing tool
cask 'obsidian'     # Markdown knowledge base
cask 'raycast'      # Productivity tool
cask 'rectangle'    # Window manager
cask 'rocket'       # Anywhere emoji picker
cask 'slack'        # Team communication
cask 'transnomino'  # File renaming tool

# Mac App Store (mas tool is unreliable but useful for documentation)
mas 'Boop', id: 1518425043          # Clipboard manager
mas 'Dato', id: 1470584107          # Menubar calendar
mas 'HazeOver', id: 430798174       # Focus tool
mas 'Things 3', id: 904280696       # Task manager
