tap 'buo/cask-upgrade' # Enables 'brew cu' to upgrade GUI apps

# Core CLI Tools
brew 'bat'        # Modern cat with syntax highlighting
brew 'eza'        # Modern ls with git integration
brew 'fzf'        # Fuzzy finder for command line
brew 'grep'       # GNU grep
brew 'htop'       # Interactive process viewer
brew 'less'       # Pager program similar to more
brew 'tree'       # Directory structure visualizer
brew 'tmux'       # Terminal multiplexer
brew 'zellij'     # Terminal multiplexer (like tmux)
brew 'zoxide'     # Shell extension to navigate your filesystem faster
brew 'zplug'      # Next-generation plugin manager for zsh

# Git Tools
brew 'gh'         # GitHub CLI
brew 'git'        # Version control
brew 'git-delta'  # Better diff viewer
brew 'pre-commit' # Git hooks manager

# Development Tools
brew 'direnv'     # Directory-specific environment variables
brew 'helix'      # Text editor
brew 'jq'         # JSON processor
brew 'dprint'     # Code formatter
brew 'markdownlint-cli2' # Markdown linter
brew 'taplo'      # TOML formatter

# Language Tools & Version Managers
brew 'nvm'        # Node.js version manager
brew 'node'       # Node.js runtime
brew 'pipx'       # Install Python applications in isolated environments
brew 'php'        # PHP language
brew 'php@8.1'    # PHP 8.1
brew 'composer'   # PHP package manager

# Cloud & Container Tools
brew 'awscli'     # AWS command line
brew 'kubectl'    # Kubernetes control
brew 'kubectx'    # Kubernetes context switcher
brew 'k9s'        # Kubernetes TUI
brew 'stern'      # Kubernetes log tailing
brew 'helm'       # Kubernetes package manager
brew 'kustomize'  # Kubernetes configuration management
brew 'terraform'  # Infrastructure as code
brew 'terraform-ls' # Terraform language server
brew 'docker'     # Container runtime

# Databases
brew 'postgresql@14' # PostgreSQL database
brew 'redis'      # In-memory data structure store
brew 'mysql@8.4'  # MySQL database


# GUI Applications Managers
brew 'mas'        # Mac App Store manager (buggy)

# GUI Applications
# Development
cask 'docker-desktop'           # Container development
cask 'ghostty'                  # Terminal emulator
cask 'bruno'                    # API testing tool
cask 'visual-studio-code'       # Code editor
cask 'zed'                      # Fast code editor
cask 'sublime-text'             # Text editor
cask 'sublime-merge'            # Git client
cask 'datagrip'                 # Database IDE
cask 'local'                    # WordPress development

# Productivity
cask '1password'    # Password manager
cask 'alfred@4'     # Spotlight replacement
cask 'arc'          # Chrome based browser
cask 'cleanshot'    # Screen capturing tool
cask 'obsidian'     # Markdown knowledge base
cask 'raycast'      # Productivity tool
cask 'rectangle'    # Window manager
cask 'rocket'       # Anywhere emoji picker
cask 'transnomino'  # File renaming tool

# Mac App Store (mas tool is unreliable but useful for documentation)
mas 'Boop', id: 1518425043          # Clipboard manager
mas 'Dato', id: 1470584107          # Menubar calendar
mas 'Hand Mirror', id: 1502839586   # Digital hand mirror
mas 'HazeOver', id: 430798174       # Focus tool
mas 'Things 3', id: 904280696       # Task manager
