tap 'buo/cask-upgrade' # Enables 'brew cu' to upgrade GUI apps
tap 'gemfury/tap'      # Gemfury package registry CLI
tap 'daveshanley/vacuum' # OpenAPI linter

# Core CLI Tools
brew 'bat'        # Modern cat with syntax highlighting
brew 'catimg'     # Image to terminal renderer (for fzf previews)
brew 'fd'         # Modern find alternative (required by fzf)
brew 'figlet'     # ASCII art text generator
brew 'fortune'    # Random fortune cookie messages
brew 'fzf'        # Fuzzy finder
brew 'lolcat'     # Rainbow colored text output
brew 'hexyl'      # Hex viewer (for fzf previews)
brew 'htop'       # Interactive process viewer
brew 'ical-buddy' # Query macOS Calendar from CLI
brew 'jless'      # JSON viewer and processor
brew 'jq'         # JSON processor
brew 'yq'         # YAML processor
brew 'lnav'       # Log file navigator and analyzer
brew 'lsd'        # Modern ls with git integration
brew 'pastel'     # Color manipulation and palette generation
brew 'prips'      # Print IP address ranges
brew 'ripgrep'    # Fast grep alternative
brew 'starship'   # Cross-shell prompt
brew 'tz'         # Time zone aware calendar and clock
brew 'watch'      # Execute command periodically
brew 'tmux'       # Terminal multiplexer
brew 'zoxide'     # Shell extension to navigate faster

# Git Tools
brew 'git'        # Version control
brew 'git-delta'  # Better diff viewer
brew 'git-filter-repo' # Git history rewriting tool
brew 'gitui'      # Terminal UI for git
brew 'gh'         # GitHub CLI
brew 'pre-commit' # Git hooks manager

# Development Tools
brew 'direnv'     # Directory-specific environment variables
brew 'dprint'     # Code formatter
brew 'fury-cli'   # Gemfury package registry CLI
brew 'glow'       # Markdown renderer with syntax highlighting
brew 'jira-cli'   # Jira issue tracker CLI
brew 'go-task'    # Modern task runner (replaces make)
brew 'neovim'     # Text editor
brew 'overmind'   # Process manager for Procfile-based apps
brew 'plantuml'   # UML diagram generator
brew 'tree-sitter-cli' # Parser generator (required for nvim-treesitter)
brew 'shellcheck' # Shell script static analysis
brew 'taplo'      # TOML formatter
brew 'vacuum'     # OpenAPI linter and validator

# Language Tools & Version Managers
brew 'mise'       # Unified runtime version manager (replaces nvm, rbenv, pyenv, etc.)
brew 'bison'      # Parser generator (required for PHP compilation)
brew 're2c'       # Lexer generator (required for PHP compilation)
brew 'php'        # PHP language (managed by Homebrew, not mise due to build complexity)
brew 'php@8.1'    # PHP 8.1
brew 'composer'   # PHP package manager

# Cloud & Container Tools
brew 'heroku'     # Heroku CLI for app deployment
brew 'kubectx'    # Kubernetes context switcher
brew 'terraform-ls' # Terraform language server
brew 'docker'     # Container runtime
brew 'ctop'       # Container monitoring
brew 'lazydocker' # Docker TUI manager

# Databases
brew 'postgresql@17' # PostgreSQL database
brew 'mysql@8.4'  # MySQL database
brew 'redis'      # In-memory data store

# GUI Applications Managers
brew 'mas'        # Mac App Store manager

# GUI Applications
# Development
cask 'bruno'                    # API testing tool
cask 'claude-code'              # AI coding assistant
cask 'datagrip'                 # Database IDE
cask 'docker-desktop'           # Container development
cask 'ghostty'                  # Terminal emulator
cask 'local'                    # WordPress development
cask 'sublime-merge'            # Git client
cask 'sublime-text'             # Text editor
cask 'taproom'                  # Homebrew package manager GUI
cask 'eagle'                    # Design asset manager

# Productivity
cask '1password'      # Password manager
cask '1password-cli'  # 1Password CLI (op command)
cask 'alfred@4'     # Spotlight replacement
cask 'firefox'        # Web browser
cask 'cleanshot'      # Screen capturing tool
cask 'magicquit'      # Auto-close idle apps
cask 'obscura-vpn'    # Privacy VPN
cask 'rouvy'          # Indoor cycling
cask 'obsidian'     # Markdown knowledge base
cask 'aerospace'    # Tiling window manager
cask 'rocket'       # Anywhere emoji picker
cask 'slack'        # Team communication
cask 'transnomino'  # File renaming tool

# Mac App Store
mas 'Bear', id: 1091189122          # Notes app
mas 'Boop', id: 1518425043          # Clipboard manager
mas 'Dato', id: 1470584107          # Menubar calendar
mas 'Googly Eyes', id: 6743048714   # Fun menubar eyes
mas 'HazeOver', id: 430798174       # Focus tool
mas 'Pandan', id: 1569600264        # Break reminder
mas 'Things 3', id: 904280696       # Task manager
